src/InformationRegisters/ЗаявкаНаИгру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЗаявкаНаИгру</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Квиз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Квизы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗаявкаНаИгру/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
//todo поменять название на ЗаявкиНаИгру

Процедура ДобавитьЗаявкуНаИгру(Квиз, Команда) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Квиз = Квиз;
	Запись.Команда = Команда;
	Запись.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаявкуНаИгру(Квиз, Команда) Экспорт
	
	Запись = РегистрыСведений.ЗаявкаНаИгру.СоздатьМенеджерЗаписи();
	Запись.Квиз = Квиз;
	Запись.Команда = Команда;
	Запись.Прочитать();
	Запись.Удалить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
